Repository: kekkill/Task2
Catalog: Resources.*.resx
Languages: ru

# GameTitle
source: WORD GAME
ru: ИГРА В СЛОВА

# RulesTitle
source: Rules:
ru: Правила:

# Rule1
source: 1. You can only use letters from the start word
ru: 1. Разрешено использовать только буквы из начального слова

# Rule2
source: 2. You cannot repeat previously spoken words
ru: 2. Нельзя повторять ранее произнесенные слова

# Rule3
source: 3. You have 15 seconds per turn
ru: 3. На 1 ход выделено 15 секунд

# Rule4
source: 4. The player who doesn't name a word in time loses
ru: 4. Проигрывает тот, кто не называет указанное слово за промежуток времени

source: Enter start word:
ru: Введите начальное слово:

# ErrorWordLength
source: Error, word length must be from 8 to 30 characters:
ru: Ошибка, длина слова должна быть от 8 до 33 символов:

# StartWordSet
source: Start word set: '{0}'
ru: начальное слово установлено: '{0}'

# PressAnyKeyToStart
source: Press any key to start the game
ru: Нажмите любую клавишу чтобы начать игру

# CurrentStartWord
source: Start word: '{0}'
ru: Начальное слово: '{0}'

# PlayerTurn
source: PLAYER {0} TURN
ru: ХОД ИГРОКА {0}

# TimeLimit
source: You have 15 seconds!
ru: У вас 15 секунд!

# WordsUsedCount
source: Words used: {0}
ru: Использовано слов: {0}

source: Words history:
ru: История слов:

# EnterWordPrompt
source: Player {0}, enter word:
ru: Игрок {0}, введите слово:

# TimeExpired
source: Player didn't enter word in time!
ru: Игрок не успел ввести слово!

# WordAccepted
source: Word '{0}' accepted!
ru: Слово '{0}' правильно

# PressAnyKeyToContinue
source: Press any key for next turn
ru: Нажмите любую клавишу для перехода хода

# ErrorEmptyWord
source: entered empty word
ru: ввел пустое слово

# ErrorInvalidLetters
source: word must consist of letters from '{0}'!
ru: слово должно состоять из букв '{0}'!

# ErrorWordUsed
source: this word was already used
ru: это слово уже использовалось

# PlayerLost
source: Player {0} lost! {1}
ru: Игрок {0} проиграл! {1}

source: GAME OVER
ru: ИГРА ОКОНЧЕНА

source: Game statistics:
ru: Статистика игры:

# TotalWordsNamed
source: Total words named: {0}
ru: Всего слов названо: {0}

# Winner
source: Winner: Player {0}
ru: Победа за: Игроком {0}

source: Player
ru: Игрок

source: Turn
ru: ход

source: Words used:
ru: Использовано слов:

source: All named words:
ru: Все названные слова:

# OutInfo
source: Press any key to exit
ru: Нажмите на любую клавишу чтобы выйти

# PressAnyKeyToExit
source: Exiting game
ru: Выход из игры

# LanguageError
source: Error,you can't enter russian symbols
ru: Ошибка, вводить можно только русские символы.
